{
	"a": [
		{
			"title": "Western Governors University",
			"subTitle": "Tech Lead, Senior UI/UX Developer",
			"url": "western-governors-university",
			"img": "/images/main/wgu.svg",
			"timeframe": "2013 - Current",
			"skills": ["AngularJS","JavaScript","jQuery","Git", "CSS3","Sass","HTML5","GruntJS","npm","svg","Responsive", "Photoshop","svg icons","Agile","Apache","JSON","API","REST","Karma","JasmineJS","Unit Tests","Protractor","SVN","Liferay","Ping Access","Hiring"],
			"summary" : "I was hired at WGU as the first UI developer on a new UI/UX team.  WGU had a student portal that was built on older technologies and wasn't able to scale.  I was tasked with moving the front-end to a more scalable solution for future student growth.",
			"points" : [
				"Introduced new technologies such as AngularJS, Sass, GruntJS.",
				"Created centralized and re-usable GruntJS based development stack with necessary tools needed for a wide variety of tasks.",
				"Built Sass centric CSS framework of reusable components to achieve a consistent brand for the students.",
				"Rebuilt student portal with AngularJS and orchestrated multiple applications and parallel releases for minimal impact on the business.",
				"Architected deployment processes, and server architecture for front-end related files.",
				"Orchestrated front-end move to service oriented architecture with minimal impact to the students.",
				"Interviewed candidates for open UI developer positions.",
				"Implemented code reviews and standards among the team.",
				"Introduced and trained on unit tests in JavaScript",
				"Trained other developers in related technologies as needed."
			],
			"screens": [
				"Rebuilt University login page that is backed by Angular.",
				"Student's home page.  Originally this had 8 iFrames on the page.  Through the standardization projects that I led we were able to remove all iFrames for this page.",
				"Study Plan app.  This is where the student spends all of there time studying.  This application was re-written in Angular with no impact on the student's learning experience.",
				"Study Plan app.  Another shot of a tab in the application.  With the application re-write I was able to architecture the application correctly and to allow for future growth to the application.",
				"Study Plan app.  A shot of the tools and UX given to the students to complete their learning in their courses.",
				"Degree Plan app.  This application allows the student to create their own schedule and pace of courses during their studies.  The app was re-written in Angular and is a lot more stable then it was before.",
				"Help app.  One of the first applications we converted over to Angular with services providing data.",
				"Resources app.  Another application that was upgraded to use Angular and services.",
				"Internal tool I created to keep track of our CSS and JS components that we had built.  This was used by other developers to know how to implement global components into their applications.",
				"Each example also includes a code sample that can be easy copied and used by the user.  The code sample is a custom Angular directive.",
				"Another shot of the component library application showing the buttons section.",
				"Financial Services app.  This application was also re-written into Angular with no impact to the student."
			],
			"screenFilenamePrefix": "wgu",
			"screenType" : "png"
			
		},
		{
			"title": "Clearlink",
			"subTitle" : "Front-End Developer",
			"url": "clearlink",
			"img": "/images/main/clearlink.png",
			"timeframe": "2012 - 2013",
			"skills": ["Responsive", "jQuery","JavaScript","JSON","AJAX", "PHP","mySQL","HTML","CSS3","Sass","Photoshop","SVN","FTP","WordPress","Apache","polyfills"],
			"summary" : "As a front-end developer at Clearlink I worked on several sites and brands.  This allowed me to quickly iterate on new skills and techniques in the industry.  ",
			"points" : [
				"Introduced responsive design and development.",
				"Introduced Sass as a CSS tool to help with large CSS projects.",
				"Created an elegant product search and checkout process for AT&amp;T services.  "
			],
			"screens": [
				"Landing page for security website I spent a lot of time working on.",
				"Custom slider made with jQuery and CSS3 transitions.",
				"Custom form validation made with jQuery.",
				"History of ADT time line built using jQuery, CSS3 animations and parallax effects.",
				"Generic home security system comparison site that I was lead front-end developer on."
			],
			"screenFilenamePrefix": "cl",
			"screenType" : "png"
		},
		{
			"title": "Brigham Young University: Chemistry Dept.",
			"subTitle": "Web Applications Developer ",
			"url": "byu-chemistry-department",
			"img": "/images/main/byu.svg",
			"timeframe": "2010 - 2012",
			"skills": ["Django","Python", "mySQL","PostgreSQL","PHP","Drupal","CSS","HTML","JavaScript","jQuery","SVN","Apache"],
			"summary" : "During my time as a web applications developer for the BYU Chemistry Department I was able to work on several exciting projects.  I was initially hired as a PHP developer to help maintain several PHP based applications.  I was cross trained in Django and spent most of my time with that technology stack.  During my time I was able to work closely with several faculty members to gather requirements, develop, test, and gather feedback.",
			"points" : [
				"Supported custom Drupal modules for department needs.",
				"Learned Django and wrote several applications with it for faculty members",
				"Worked closely with faculty to gather requirements, test, and improve applications.",
				"Helped interview candidates"

			]
		},
		{
			"title": "Brigham Young University: Office of IT",
			"subTitle": "Physical Infrastructure Documentation",
			"url": "byu-office-of-it",
			"img": "/images/main/byu.svg",
			"timeframe": "2008 - 2010",
			"summary" : "Used custom web application to document BYU's physical network.  I was able to spend some time working with the supporting database of the application.",
			"skills": ["mySQL","Apache"]
		}
	],
	"b": [
		{
			"title": "Remind Me When",
			"subTitle" : "In Progress",
			"url": "remind-me-when",
			"img": "/images/main/alarm.svg",
			"skills": ["AngularJS","Django","REST","API","CSS3","HTML5","JavaScript","Apache","Python","Cron","Git","Database"],
			
			"summary": "This is a current work in progress web application that I am making.  I wanted to play around with a custom API and bearer tokens with a slick Angular driven front-end.  The back end was built on Django but I am looking at moving it over to MongoDB, NodeJS, and Express just to play with newer technologies.  The purpose of the application is to allow people to set long term reminders such as 'remind me in 3 months to change my air filter'.  I am striving for an easy and streamlined user experience.",
			"screens": ["Currently a work in progress.  Users are able to create, edit, and delete long term reminders."],
			"screenFilenamePrefix": "reminders",
			"screenType" : "png"
		},
		{
			"title": "Native Apps",
			"url": "apps",
			"subTitle" : "In Progress",
			"img": "/images/main/corona.png",
			"skills": ["CoronaSDK","LUA","Photoshop","Illustrator","iOS","Android"],
			"summary" : "I like to spend some of my free time making little games for iOS and Android.  It's a way for me to work on something smaller and to all aspects required for a game (coding, sound, graphics, etc.).  I have found that working in another language has also helped me learn some new ideas that have transferred to my other core coding languages.",
			"screenFilenamePrefix": "app",
			"screenType" : "png",
			"screens": [
					"Disneyland Trivia app home screen",
					"Disneyland Trivia app trivia pack selection screen.",
					"Disneyland Trivia app game play.  A user selects the correct answer as quickly as possible for the most points.",
					"Santa Launcher game main menu.",
					"Santa Launcher game play.  Users select the angle and how much power to fire Santa out of the cannon with.",
					"Santa Launcher game play.  Santa bounces across rooftops.  Certain things will slow him down, others will blast him back up into the air.",
					"Counting for Toddlers main screen",
					"Counting for Toddlers game play where kids touch the items to count them.",
					"Counting for Toddlers game play."

			]
		},
		{
			"title": "Trivia Builder",
			"url": "trivia-builder",
			"subTitle" : "Live",
			"img" : "/images/main/list.svg",
			"skills": ["AngularJS","PHP","API","REST","CSS3","Bootstrap","HTML5","Responsive","jQuery","Database"],
			"summary" : "Trivia Builder is a utility site that helps me create trivia questions for my trivia based applications.  It has several features and functionality to make writing trivia questions and answers easy and simple.  It originally was written in jQuery but I upgraded it to AngularJS to help with my skills.",
			"screens": [
				"Selection screen where I can do simple CRUD operations for various trivia packs.",
				"Interface to add new questions and answers and to view already entered items.",
				"One of the questions opened showing the possible answers for that question.",
				"Edit screen for a question.  There's also the ability to do Spanish translations of questions."
			],
			"screenFilenamePrefix": "trivia",
			"screenType" : "png"
		},
		{
			"title": "Expense Reporter",
			"url": "expense-reporter",
			"subTitle" : "Live",
			"img": "/images/main/money.svg",
			"skills": ["AngularJS","PHP","API","REST","CSS3","Bootstrap","HTML5","Responsive","jQuery","Database"],
			"summary" : "A single page application that allows me to track my income and expenses related to side projects I do.",
			"screens": [
				"Table view of expenses and income with form entry for new items.",
				"Features easy to use CRUD operations as needed for new entry items.",
				"Graph of income over time."
			],
			"screenFilenamePrefix": "budget",
			"screenType" : "png"
		}
		,
		{
			"title": "Rendered Mouse",
			"url": "rendered-mouse",
			"subTitle" : "Live",
			"exampleUrl": "http://www.renederedmouse.com",
			"img": "/images/main/rm.svg",
			"skills": ["Django","Responsive","CSS3","HTML5","Database","SEO"],
			"summary" : "One of my huge interests is theme parks and Disneyland.  Rendered Mouse is what I publish those projects under and this site is a showcase for them."
		},
		{
			"title": "Yesterday's Big Thing",
			"url": "yesterdays-big-thing",
			"subTitle" : "Discontinued",
			"exampleUrl": "http://web.archive.org/web/20140130111809/http://www.yesterdaysbigthing.com/2014/01/30/",
			"img": "/images/main/ybt.png",
			"skills": ["Django","Responsive","CSS3","HTML5","Database","SEO","YouTube","API"],
			"summary" : "Yesterday's Big Thing was a YouTube aggregator site.  It featured new videos across several categories everyday.  The admin interface was custom made and extremely easy to use.  The site ran for over 2 years before I decided to stop updating it because of time.  It can be viewed through the Way Back Machine. ",
			"screens": [
				"Main landing page to view the biggest video on the web from yesterday.",
				"Archive list down below the main video.",
				"Form entry for anyone to submit a video to be considered.  Also wrote a bookmarklet that offered the same functionality from a bookmark."
			],
			"screenFilenamePrefix": "ybt",
			"screenType" : "png"
		},
		{
			"title": "Digital Nurse Practitioner Software",
			"url": "capstone",
			"subTitle" : "Capstone Project",
			"img": "/images/main/byu.svg",
			"skills": ["Django","Responsive","CSS3","HTML5","Database","API"],
			"summary" : "For our capstone project we worked with the graduate nursing program of BYU.  We worked with them as a client to solve the issue they had with massive amounts of paper documents.  We built a digital nurse practitioner evaluation platform for the project.  This allowed necessary parties to create, complete, and review evaluation forms.  We also provided the ability to view items offline as needed when traveling to locations without an internet connection."
		},
		{
			"title": "CoasterWall",
			"url" : "coasterwall",
			"subTitle": "Discontinued",
			"img" : "/images/main/cw.png",
			"skills": ["Django","CSS","jQuery","HTML","Database","SEO","Accounts"],
			"summary": "CoasterWall was one of my ultimate side projects.  The site was a place to share theme park centered desktop pictures.  It allowed users to upload images, crop them, and tag them for others to see.  It was a lot of work and fun project to work on.  It featured an admin panel with an email alert system to approve all new uploads from users.",
			"screenFilenamePrefix":"cw"
			
		},
		{
			"title": "Portfolio",
			"url": "portfolio",
			"img": "/images/main/folder.svg",
			"exampleUrl" : "https://github.com/Fernker/portfolio",
			"skills": ["AngularJS","Responsive","CSS3","HTML5","JSON","Git"],
			"summary" : "I needed a simple and clean portfolio to professionally showcase my work.  This was built with much love and care using AngularJS (~v1.4). "
		}
	],
	"education": {
		"title": "Brigham Young University",
		"subTitle" : "B.S. Information Technology",
		"timeframe" : "2012",
		"img" : "/images/main/byu.svg",
		"url" : "byu"
	}
}